W11D1/tea_time_solution/app/controllers/api/teas_controller.rb

  def index
    teas = Tea.all
---
SELECT "teas".* FROM "teas"

  def create
    tea = Tea.new(tea_params)

     if tea.save
---
INSERT INTO "teas" ("flavor", "amount") VALUES ($1, $2) RETURNING "id"  [["flavor", "Green"], ["amount", 4.5]]